perf_output/before/memcached-1.6.9/16/memcached-1.6.9_workloada_16_load.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:memcached-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /proj/proxyweb-PG0/adona/YCSB/memcached/conf:/proj/proxyweb-PG0/adona/YCSB/memcached/target/memcached-binding-0.18.0-SNAPSHOT.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.13/jackson-mapper-asl-1.9.13.jar:/root/.m2/repository/net/spy/spymemcached/2.11.4/spymemcached-2.11.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/proj/proxyweb-PG0/adona/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloada -p memcached.hosts=localhost:11211 -load
Command line: -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloada -p memcached.hosts=localhost:11211 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2021-08-11 17:34:50:187 0 sec: 0 operations; est completion in 0 second 
2021-08-11 17:34:50.297 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.297 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.297 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
[...]
2021-08-11 17:34:50.299 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.298 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.301 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.302 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-08-11 17:34:50.302 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.304 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.304 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.306 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.306 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.307 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.307 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.308 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:34:50.515 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.515 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.514 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.514 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.517 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.518 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.519 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.520 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.521 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.522 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.522 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.523 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.524 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.524 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.525 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50.525 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:34:50:522 0 sec: 1000 operations; 2976.19 current ops/sec; [CLEANUP: Count=16, Max=9559, Min=4844, Avg=7472.62, 90=9311, 99=9559, 99.9=9559, 99.99=9559] [INSERT: Count=1000, Max=94847, Min=349, Avg=2924.58, 90=3019, 99=92223, 99.9=94719, 99.99=94847] 
[OVERALL], RunTime(ms), 336
[OVERALL], Throughput(ops/sec), 2976.190476190476
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 7472.625
[CLEANUP], MinLatency(us), 4844
[CLEANUP], MaxLatency(us), 9559
[CLEANUP], 95thPercentileLatency(us), 9359
[CLEANUP], 99thPercentileLatency(us), 9559
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 2924.577
[INSERT], MinLatency(us), 349
[INSERT], MaxLatency(us), 94847
[INSERT], 95thPercentileLatency(us), 3863
[INSERT], 99thPercentileLatency(us), 92223
[INSERT], Return=OK, 1000

 Performance counter stats for 'system wide':

       81053710135      cycles                                                        (66.68%)
       16452929341      branches                                                      (66.68%)
         624755008      branch-misses             #    3.80% of all branches          (66.67%)
       16417929333      branch-loads                                                  (66.67%)
         626738958      branch-load-misses                                            (66.66%)
         727203449      L1-icache-load-misses                                         (66.66%)

      12.604448781 seconds time elapsed